# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [5]:
series1 = pd.Series(np.random.randint(low=1, high=5, size=100))
series2 = pd.Series(np.random.randint(low=1, high=4, size=100))
series3 = pd.Series(np.random.randint(low=10000, high=30001, size = 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
housemkt = pd.concat([series1,series2,series3],axis=1)
housemkt.head()

   0  1      2
0  1  1  13898
1  4  2  10825
2  3  1  18621
3  2  2  23090
4  2  2  20054

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [15]:
housemkt.rename(columns={0:"bedrs", 1:"bathrs",2:"price_sqr_meter"},inplace=True)
housemkt

    bedrs  bathrs  price_sqr_meter
0       1       1            13898
1       4       2            10825
2       3       1            18621
3       2       2            23090
4       2       2            20054
..    ...     ...              ...
95      3       1            28915
96      1       1            14861
97      4       3            29191
98      1       1            20275
99      1       2            25129

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [24]:
bigcolumn = pd.concat([series1,series2,series3]).to_frame()
bigcolumn

        0
0       1
1       4
2       3
3       2
4       2
..    ...
95  28915
96  14861
97  29191
98  20275
99  25129

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [25]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [32]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        4
2        3
3        2
4        2
..     ...
295  28915
296  14861
297  29191
298  20275
299  25129

[300 rows x 1 columns]